AG_2019/SOA/JDACreateItemProcess/SOA/testsuites/untitled1.xml

<?xml version='1.0' encoding='windows-1252'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ags="http://mx.agarcia.ea/Commons/Schemas/AGStandardHeader" xmlns:cre="http://mx.agarcia.ea/Capabilities/Core/Items/CreateItemEntity" xmlns:v1="http://mx.agarcia.ea/Canonical/Commons/Items/v1" xmlns:v11="http://mx.agarcia.ea/Canonical/Commons/Suppliers/v1">
   <soapenv:Header>
      <ags:headerMessage>
         <ags:userName>?</ags:userName>
         <ags:sucId>?</ags:sucId>
         <ags:source>?</ags:source>
         <ags:user>?</ags:user>
         <ags:consumerId>?</ags:consumerId>
         <ags:destionatonId>?</ags:destionatonId>
         <ags:parameters>
            <ags:parameter Key="?">?</ags:parameter>
         </ags:parameters>
      </ags:headerMessage>
   </soapenv:Header>
   <soapenv:Body>
      <createItemRequest xmlns:cre="http://mx.agarcia.ea/Capabilities/Core/Items/CreateItemEntity" xmlns:v1="http://mx.agarcia.ea/Canonical/Commons/Items/v1" xmlns:v11="http://mx.agarcia.ea/Canonical/Commons/Suppliers/v1" xmlns="http://mx.agarcia.ea/Capabilities/Core/Items/CreateItemEntity" xmlns:wsa="http://www.w3.org/2005/08/addressing">
         <cre:items>
            <item>
               <id Name="Prototipos" Type="SKU">100010397</id>
               <name>BATA</name>
               <description>Descripción del Estilo</description>
               <shortDescription>BATA</shortDescription>
               <itemHierarchyInfo>
                  <hierarchy Type="Division">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Department">
                     <id>301</id>
                  </hierarchy>
                  <hierarchy Type="Class">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Type">
                     <id>1</id>
                  </hierarchy>
               </itemHierarchyInfo>
               <owner>jmoreno</owner>
               <price>140.0</price>
               <cost>70.0</cost>
               <itemDetailInfo>
                  <colors>
                     <color>
                        <id>15</id>
                     </color>
                  </colors>
                  <sizes>
                     <size>
                        <id>133</id>
                     </size>
                  </sizes>
                  <supplier>
                     <supplierID>900</supplierID>
                  </supplier>
               </itemDetailInfo>
               <catalogs>
                  <catalog Type="Family">
                     <id>18</id>
                  </catalog>
                  <catalog Type="Expiration">
                     <id>70</id>
                  </catalog>
                  <catalog Type="WeekFloorSale">
                     <id>38</id>
                  </catalog>
                  <catalog Type="Consumer">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Furnishing">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Sticker">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Warehouse">
                     <id>11</id>
                  </catalog>
               </catalogs>
               <parent>
                  <id Type="Style">301190700520703</id>
                  <itemDetailInfo>
                     <colorGroup>
                        <id>10001</id>
                     </colorGroup>
                     <sizeGroup>
                        <id>10007</id>
                     </sizeGroup>
                  </itemDetailInfo>
               </parent>
               <images>
                  <itemImage>
                     <url>http://10.0.0.16:3000/uploads/photo/thumb_5f9651e35e70602a4848c38839c3c54f.jpg</url>
                  </itemImage>
               </images>
            </item>
            <item>
               <id Name="Prototipos" Type="SKU">100010398</id>
               <name>BATA</name>
               <description>Descripción del Estilo</description>
               <shortDescription>BATA</shortDescription>
               <itemHierarchyInfo>
                  <hierarchy Type="Division">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Department">
                     <id>301</id>
                  </hierarchy>
                  <hierarchy Type="Class">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Type">
                     <id>1</id>
                  </hierarchy>
               </itemHierarchyInfo>
               <owner>jmoreno</owner>
               <price>140.0</price>
               <cost>70.0</cost>
               <itemDetailInfo>
                  <colors>
                     <color>
                        <id>15</id>
                     </color>
                  </colors>
                  <sizes>
                     <size>
                        <id>134</id>
                     </size>
                  </sizes>
                  <supplier>
                     <supplierID>900</supplierID>
                  </supplier>
               </itemDetailInfo>
               <catalogs>
                  <catalog Type="Family">
                     <id>18</id>
                  </catalog>
                  <catalog Type="Expiration">
                     <id>70</id>
                  </catalog>
                  <catalog Type="WeekFloorSale">
                     <id>38</id>
                  </catalog>
                  <catalog Type="Consumer">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Furnishing">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Sticker">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Warehouse">
                     <id>11</id>
                  </catalog>
               </catalogs>
               <parent>
                  <id Type="Style">301190700520703</id>
                  <itemDetailInfo>
                     <colorGroup>
                        <id>10001</id>
                     </colorGroup>
                     <sizeGroup>
                        <id>10007</id>
                     </sizeGroup>
                  </itemDetailInfo>
               </parent>
               <images>
                  <itemImage>
                     <url>http://10.0.0.16:3000/uploads/photo/thumb_5f9651e35e70602a4848c38839c3c54f.jpg</url>
                  </itemImage>
               </images>
            </item>
            <item>
               <id Name="Prototipos" Type="SKU">100010399</id>
               <name>BATA</name>
               <description>Descripción del Estilo</description>
               <shortDescription>BATA</shortDescription>
               <itemHierarchyInfo>
                  <hierarchy Type="Division">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Department">
                     <id>301</id>
                  </hierarchy>
                  <hierarchy Type="Class">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Type">
                     <id>1</id>
                  </hierarchy>
               </itemHierarchyInfo>
               <owner>jmoreno</owner>
               <price>140.0</price>
               <cost>70.0</cost>
               <itemDetailInfo>
                  <colors>
                     <color>
                        <id>15</id>
                     </color>
                  </colors>
                  <sizes>
                     <size>
                        <id>135</id>
                     </size>
                  </sizes>
                  <supplier>
                     <supplierID>900</supplierID>
                  </supplier>
               </itemDetailInfo>
               <catalogs>
                  <catalog Type="Family">
                     <id>18</id>
                  </catalog>
                  <catalog Type="Expiration">
                     <id>70</id>
                  </catalog>
                  <catalog Type="WeekFloorSale">
                     <id>38</id>
                  </catalog>
                  <catalog Type="Consumer">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Furnishing">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Sticker">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Warehouse">
                     <id>11</id>
                  </catalog>
               </catalogs>
               <parent>
                  <id Type="Style">301190700520703</id>
                  <itemDetailInfo>
                     <colorGroup>
                        <id>10001</id>
                     </colorGroup>
                     <sizeGroup>
                        <id>10007</id>
                     </sizeGroup>
                  </itemDetailInfo>
               </parent>
               <images>
                  <itemImage>
                     <url>http://10.0.0.16:3000/uploads/photo/thumb_5f9651e35e70602a4848c38839c3c54f.jpg</url>
                  </itemImage>
               </images>
            </item>
            <item>
               <id Name="Prototipos" Type="SKU">100010400</id>
               <name>BATA</name>
               <description>Descripción del Estilo</description>
               <shortDescription>BATA</shortDescription>
               <itemHierarchyInfo>
                  <hierarchy Type="Division">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Department">
                     <id>301</id>
                  </hierarchy>
                  <hierarchy Type="Class">
                     <id>3</id>
                  </hierarchy>
                  <hierarchy Type="Type">
                     <id>1</id>
                  </hierarchy>
               </itemHierarchyInfo>
               <owner>jmoreno</owner>
               <price>140.0</price>
               <cost>70.0</cost>
               <itemDetailInfo>
                  <colors>
                     <color>
                        <id>15</id>
                     </color>
                  </colors>
                  <sizes>
                     <size>
                        <id>136</id>
                     </size>
                  </sizes>
                  <supplier>
                     <supplierID>900</supplierID>
                  </supplier>
               </itemDetailInfo>
               <catalogs>
                  <catalog Type="Family">
                     <id>18</id>
                  </catalog>
                  <catalog Type="Expiration">
                     <id>70</id>
                  </catalog>
                  <catalog Type="WeekFloorSale">
                     <id>38</id>
                  </catalog>
                  <catalog Type="Consumer">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Furnishing">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Sticker">
                     <id>1</id>
                  </catalog>
                  <catalog Type="Warehouse">
                     <id>11</id>
                  </catalog>
               </catalogs>
               <parent>
                  <id Type="Style">301190700520703</id>
                  <itemDetailInfo>
                     <colorGroup>
                        <id>10001</id>
                     </colorGroup>
                     <sizeGroup>
                        <id>10007</id>
                     </sizeGroup>
                  </itemDetailInfo>
               </parent>
               <images>
                  <itemImage>
                     <url>http://10.0.0.16:3000/uploads/photo/thumb_5f9651e35e70602a4848c38839c3c54f.jpg</url>
                  </itemImage>
               </images>
            </item>
         </cre:items>
      </createItemRequest>
   </soapenv:Body>
</soapenv:Envelope>
